## Data Exploration
---

In [1]:
import kagglehub 
import pandas as pd 
import os 
# Download latest version 
path = kagglehub.dataset_download("pavansubhasht/ibm-hr-analytics-attrition-dataset") 
print("Path to dataset files:", path) 
csv_file_path = os.path.join(path, "WA_Fn-UseC_-HR-Employee-Attrition.csv") 
data_df = pd.read_csv(csv_file_path) 
#print(data_df.head()) 
print(data_df.info())

C:\Users\sodji\AppData\Roaming\Python\Python313\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.13), please consider upgrading to the latest version (0.4.1).
Path to dataset files: C:\Users\sodji\.cache\kagglehub\datasets\pavansubhasht\ibm-hr-analytics-attrition-dataset\versions\1
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB
None

### About the dataset

Uncover the factors that lead to employee attrition and explore important questions such as ‘show me a breakdown of distance from home by job role and attrition’ or ‘compare average monthly income by education and attrition’. This is a fictional data set created by IBM data scientists.

Education:
1 'Below College'
2 'College'
3 'Bachelor'
4 'Master'
5 'Doctor'

EnvironmentSatisfaction:
1 'Low'
2 'Medium'
3 'High'
4 'Very High'

JobInvolvement:
1 'Low'
2 'Medium'
3 'High'
4 'Very High'

JobSatisfaction:
1 'Low'
2 'Medium'
3 'High'
4 'Very High'

PerformanceRating:
1 'Low'
2 'Good'
3 'Excellent'
4 'Outstanding'

RelationshipSatisfaction:
1 'Low'
2 'Medium'
3 'High'
4 'Very High'

WorkLifeBalance:
1 'Bad'
2 'Good'
3 'Better'
4 'Best'

### Preprocessing

In [2]:
print(data_df.columns)

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [2]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [9]:
# Display rows where EmployeeNumber is 1
print("Rows where EmployeeNumber is 1:")
data_df[data_df['EmployeeNumber'] == 1]

Rows where EmployeeNumber is 1:

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5

In [5]:
data_df["Department"].unique()

array(['Sales', 'Research & Development', 'Human Resources'], dtype=object)

In [16]:
data_df["JobRole"].unique()

array(['Sales Executive', 'Research Scientist', 'Laboratory Technician',
       'Manufacturing Director', 'Healthcare Representative', 'Manager',
       'Sales Representative', 'Research Director', 'Human Resources'],
      dtype=object)

In [ ]:
# Missing values count
data_df.isnull().sum().sum()

np.int64(0)

In [ ]:
# Check duplicate rows
data_df.duplicated().sum()

np.int64(0)

In [26]:
useful_cols = ['EmployeeNumber','Age', 'Attrition','Department', 'Education', 'JobRole', 
       'MonthlyIncome', 'EnvironmentSatisfaction', 'JobInvolvement', 'RelationshipSatisfaction', 'PerformanceRating', 'JobSatisfaction','WorkLifeBalance']

### Compute of kpi

In [48]:
len(data_df[data_df['Attrition']== 'Yes'])/len(data_df) * 100

16.122448979591837

### Performance by department

In [54]:
data_df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,attrition_bin,Attrition_bin
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,0,8,0,1,6,4,0,5,1,1
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,1,10,3,3,10,7,1,7,0,0
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,0,7,3,3,0,0,0,0,1,1
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,0,8,3,3,8,7,3,0,0,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,1,6,3,3,2,2,2,2,0,0

### Create datafram with respect to each department

In [ ]:
use_df = data_df[useful_cols]

In [ ]:
use_df['Attrition_bin'] = use_df['Attrition'].map({'Yes': 1, 'No': 0})

In [28]:
data_sales =  use_df[use_df["Department"] == "Sales"]
data_sales = data_sales.reset_index(drop=True)
data_sales = data_sales.drop(columns=["Department"])
data_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 446 entries, 0 to 445
Data columns (total 12 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   EmployeeNumber            446 non-null    int64
 1   Age                       446 non-null    int64
 2   Attrition                 446 non-null    object
 3   Education                 446 non-null    int64
 4   JobRole                   446 non-null    object
 5   MonthlyIncome             446 non-null    int64
 6   EnvironmentSatisfaction   446 non-null    int64
 7   JobInvolvement            446 non-null    int64
 8   RelationshipSatisfaction  446 non-null    int64
 9   PerformanceRating         446 non-null    int64
 10  JobSatisfaction           446 non-null    int64
 11  WorkLifeBalance           446 non-null    int64
dtypes: int64(10), object(2)
memory usage: 41.9+ KB

In [34]:
def data_department(department_name, data_df):
    use_df = data_df[useful_cols]
    data_dep =  use_df[use_df["Department"] == department_name]
    data_dep = data_dep.reset_index(drop=True)
    data_dep = data_dep.drop(columns=["Department"])
    return data_dep

In [38]:
data_department('Human Resources', data_df)

,EmployeeNumber,Age,Attrition,Education,JobRole,MonthlyIncome,EnvironmentSatisfaction,JobInvolvement,RelationshipSatisfaction,PerformanceRating,JobSatisfaction,WorkLifeBalance
0,103,46,No,2,Human Resources,5021,2,3,4,4,2,3
1,133,37,Yes,4,Human Resources,2073,3,3,4,4,1,3
2,140,59,No,4,Manager,18844,3,2,4,4,4,3
3,148,54,No,3,Manager,17328,4,4,3,3,4,3
4,177,26,No,1,Human Resources,2942,3,3,4,4,3,3
...,...,...,...,...,...,...,...,...,...,...,...,...
58,1944,27,Yes,3,Human Resources,2863,1,2,1,3,2,3
59,1972,38,No,4,Human Resources,2991,4,3,2,3,2,3
60,1973,55,No,4,Manager,19636,3,4,1,3,2,3
61,1987,25,No,3,Human Resources,2187,3,3,3,3,2,3
62,2040,35,No,4,Human Resources,8837,3,3,3,3,4,3

In [55]:
data_df["JobRole"].unique()

array(['Sales Executive', 'Research Scientist', 'Laboratory Technician',
       'Manufacturing Director', 'Healthcare Representative', 'Manager',
       'Sales Representative', 'Research Director', 'Human Resources'],
      dtype=object)